__________________________________________________________________________________________________
Layer (type)                    Output Shape         Param #     Connected to                     
==================================================================================================
data (InputLayer)               (None, 50, 50, 3)    0                                            
__________________________________________________________________________________________________
bn_data (BatchNormalization)    (None, 50, 50, 3)    9           data[0][0]                       
__________________________________________________________________________________________________
zero_padding2d_1 (ZeroPadding2D (None, 56, 56, 3)    0           bn_data[0][0]                    
__________________________________________________________________________________________________
conv0 (Conv2D)                  (None, 25, 25, 64)   9408        zero_padding2d_1[0][0]           
__________________________________________________________________________________________________
bn0 (BatchNormalization)        (None, 25, 25, 64)   256         conv0[0][0]                      
__________________________________________________________________________________________________
relu0 (Activation)              (None, 25, 25, 64)   0           bn0[0][0]                        
__________________________________________________________________________________________________
zero_padding2d_2 (ZeroPadding2D (None, 27, 27, 64)   0           relu0[0][0]                      
__________________________________________________________________________________________________
pooling0 (MaxPooling2D)         (None, 13, 13, 64)   0           zero_padding2d_2[0][0]           
__________________________________________________________________________________________________
stage1_unit1_bn1 (BatchNormaliz (None, 13, 13, 64)   256         pooling0[0][0]                   
__________________________________________________________________________________________________
stage1_unit1_relu1 (Activation) (None, 13, 13, 64)   0           stage1_unit1_bn1[0][0]           
__________________________________________________________________________________________________
stage1_unit1_conv1 (Conv2D)     (None, 13, 13, 64)   4096        stage1_unit1_relu1[0][0]         
__________________________________________________________________________________________________
stage1_unit1_bn2 (BatchNormaliz (None, 13, 13, 64)   256         stage1_unit1_conv1[0][0]         
__________________________________________________________________________________________________
stage1_unit1_relu2 (Activation) (None, 13, 13, 64)   0           stage1_unit1_bn2[0][0]           
__________________________________________________________________________________________________
zero_padding2d_3 (ZeroPadding2D (None, 15, 15, 64)   0           stage1_unit1_relu2[0][0]         
__________________________________________________________________________________________________
stage1_unit1_conv2 (Conv2D)     (None, 13, 13, 64)   36864       zero_padding2d_3[0][0]           
__________________________________________________________________________________________________
stage1_unit1_bn3 (BatchNormaliz (None, 13, 13, 64)   256         stage1_unit1_conv2[0][0]         
__________________________________________________________________________________________________
stage1_unit1_relu3 (Activation) (None, 13, 13, 64)   0           stage1_unit1_bn3[0][0]           
__________________________________________________________________________________________________
stage1_unit1_conv3 (Conv2D)     (None, 13, 13, 256)  16384       stage1_unit1_relu3[0][0]         
__________________________________________________________________________________________________
stage1_unit1_sc (Conv2D)        (None, 13, 13, 256)  16384       stage1_unit1_relu1[0][0]         
__________________________________________________________________________________________________
add_1 (Add)                     (None, 13, 13, 256)  0           stage1_unit1_conv3[0][0]         
                                                                 stage1_unit1_sc[0][0]            
__________________________________________________________________________________________________
stage1_unit2_bn1 (BatchNormaliz (None, 13, 13, 256)  1024        add_1[0][0]                      
__________________________________________________________________________________________________
stage1_unit2_relu1 (Activation) (None, 13, 13, 256)  0           stage1_unit2_bn1[0][0]           
__________________________________________________________________________________________________
stage1_unit2_conv1 (Conv2D)     (None, 13, 13, 64)   16384       stage1_unit2_relu1[0][0]         
__________________________________________________________________________________________________
stage1_unit2_bn2 (BatchNormaliz (None, 13, 13, 64)   256         stage1_unit2_conv1[0][0]         
__________________________________________________________________________________________________
stage1_unit2_relu2 (Activation) (None, 13, 13, 64)   0           stage1_unit2_bn2[0][0]           
__________________________________________________________________________________________________
zero_padding2d_4 (ZeroPadding2D (None, 15, 15, 64)   0           stage1_unit2_relu2[0][0]         
__________________________________________________________________________________________________
stage1_unit2_conv2 (Conv2D)     (None, 13, 13, 64)   36864       zero_padding2d_4[0][0]           
__________________________________________________________________________________________________
stage1_unit2_bn3 (BatchNormaliz (None, 13, 13, 64)   256         stage1_unit2_conv2[0][0]         
__________________________________________________________________________________________________
stage1_unit2_relu3 (Activation) (None, 13, 13, 64)   0           stage1_unit2_bn3[0][0]           
__________________________________________________________________________________________________
stage1_unit2_conv3 (Conv2D)     (None, 13, 13, 256)  16384       stage1_unit2_relu3[0][0]         
__________________________________________________________________________________________________
add_2 (Add)                     (None, 13, 13, 256)  0           stage1_unit2_conv3[0][0]         
                                                                 add_1[0][0]                      
__________________________________________________________________________________________________
stage1_unit3_bn1 (BatchNormaliz (None, 13, 13, 256)  1024        add_2[0][0]                      
__________________________________________________________________________________________________
stage1_unit3_relu1 (Activation) (None, 13, 13, 256)  0           stage1_unit3_bn1[0][0]           
__________________________________________________________________________________________________
stage1_unit3_conv1 (Conv2D)     (None, 13, 13, 64)   16384       stage1_unit3_relu1[0][0]         
__________________________________________________________________________________________________
stage1_unit3_bn2 (BatchNormaliz (None, 13, 13, 64)   256         stage1_unit3_conv1[0][0]         
__________________________________________________________________________________________________
stage1_unit3_relu2 (Activation) (None, 13, 13, 64)   0           stage1_unit3_bn2[0][0]           
__________________________________________________________________________________________________
zero_padding2d_5 (ZeroPadding2D (None, 15, 15, 64)   0           stage1_unit3_relu2[0][0]         
__________________________________________________________________________________________________
stage1_unit3_conv2 (Conv2D)     (None, 13, 13, 64)   36864       zero_padding2d_5[0][0]           
__________________________________________________________________________________________________
stage1_unit3_bn3 (BatchNormaliz (None, 13, 13, 64)   256         stage1_unit3_conv2[0][0]         
__________________________________________________________________________________________________
stage1_unit3_relu3 (Activation) (None, 13, 13, 64)   0           stage1_unit3_bn3[0][0]           
__________________________________________________________________________________________________
stage1_unit3_conv3 (Conv2D)     (None, 13, 13, 256)  16384       stage1_unit3_relu3[0][0]         
__________________________________________________________________________________________________
add_3 (Add)                     (None, 13, 13, 256)  0           stage1_unit3_conv3[0][0]         
                                                                 add_2[0][0]                      
__________________________________________________________________________________________________
stage2_unit1_bn1 (BatchNormaliz (None, 13, 13, 256)  1024        add_3[0][0]                      
__________________________________________________________________________________________________
stage2_unit1_relu1 (Activation) (None, 13, 13, 256)  0           stage2_unit1_bn1[0][0]           
__________________________________________________________________________________________________
stage2_unit1_conv1 (Conv2D)     (None, 13, 13, 128)  32768       stage2_unit1_relu1[0][0]         
__________________________________________________________________________________________________
stage2_unit1_bn2 (BatchNormaliz (None, 13, 13, 128)  512         stage2_unit1_conv1[0][0]         
__________________________________________________________________________________________________
stage2_unit1_relu2 (Activation) (None, 13, 13, 128)  0           stage2_unit1_bn2[0][0]           
__________________________________________________________________________________________________
zero_padding2d_6 (ZeroPadding2D (None, 15, 15, 128)  0           stage2_unit1_relu2[0][0]         
__________________________________________________________________________________________________
stage2_unit1_conv2 (Conv2D)     (None, 7, 7, 128)    147456      zero_padding2d_6[0][0]           
__________________________________________________________________________________________________
stage2_unit1_bn3 (BatchNormaliz (None, 7, 7, 128)    512         stage2_unit1_conv2[0][0]         
__________________________________________________________________________________________________
stage2_unit1_relu3 (Activation) (None, 7, 7, 128)    0           stage2_unit1_bn3[0][0]           
__________________________________________________________________________________________________
stage2_unit1_conv3 (Conv2D)     (None, 7, 7, 512)    65536       stage2_unit1_relu3[0][0]         
__________________________________________________________________________________________________
stage2_unit1_sc (Conv2D)        (None, 7, 7, 512)    131072      stage2_unit1_relu1[0][0]         
__________________________________________________________________________________________________
add_4 (Add)                     (None, 7, 7, 512)    0           stage2_unit1_conv3[0][0]         
                                                                 stage2_unit1_sc[0][0]            
__________________________________________________________________________________________________
stage2_unit2_bn1 (BatchNormaliz (None, 7, 7, 512)    2048        add_4[0][0]                      
__________________________________________________________________________________________________
stage2_unit2_relu1 (Activation) (None, 7, 7, 512)    0           stage2_unit2_bn1[0][0]           
__________________________________________________________________________________________________
stage2_unit2_conv1 (Conv2D)     (None, 7, 7, 128)    65536       stage2_unit2_relu1[0][0]         
__________________________________________________________________________________________________
stage2_unit2_bn2 (BatchNormaliz (None, 7, 7, 128)    512         stage2_unit2_conv1[0][0]         
__________________________________________________________________________________________________
stage2_unit2_relu2 (Activation) (None, 7, 7, 128)    0           stage2_unit2_bn2[0][0]           
__________________________________________________________________________________________________
zero_padding2d_7 (ZeroPadding2D (None, 9, 9, 128)    0           stage2_unit2_relu2[0][0]         
__________________________________________________________________________________________________
stage2_unit2_conv2 (Conv2D)     (None, 7, 7, 128)    147456      zero_padding2d_7[0][0]           
__________________________________________________________________________________________________
stage2_unit2_bn3 (BatchNormaliz (None, 7, 7, 128)    512         stage2_unit2_conv2[0][0]         
__________________________________________________________________________________________________
stage2_unit2_relu3 (Activation) (None, 7, 7, 128)    0           stage2_unit2_bn3[0][0]           
__________________________________________________________________________________________________
stage2_unit2_conv3 (Conv2D)     (None, 7, 7, 512)    65536       stage2_unit2_relu3[0][0]         
__________________________________________________________________________________________________
add_5 (Add)                     (None, 7, 7, 512)    0           stage2_unit2_conv3[0][0]         
                                                                 add_4[0][0]                      
__________________________________________________________________________________________________
stage2_unit3_bn1 (BatchNormaliz (None, 7, 7, 512)    2048        add_5[0][0]                      
__________________________________________________________________________________________________
stage2_unit3_relu1 (Activation) (None, 7, 7, 512)    0           stage2_unit3_bn1[0][0]           
__________________________________________________________________________________________________
stage2_unit3_conv1 (Conv2D)     (None, 7, 7, 128)    65536       stage2_unit3_relu1[0][0]         
__________________________________________________________________________________________________
stage2_unit3_bn2 (BatchNormaliz (None, 7, 7, 128)    512         stage2_unit3_conv1[0][0]         
__________________________________________________________________________________________________
stage2_unit3_relu2 (Activation) (None, 7, 7, 128)    0           stage2_unit3_bn2[0][0]           
__________________________________________________________________________________________________
zero_padding2d_8 (ZeroPadding2D (None, 9, 9, 128)    0           stage2_unit3_relu2[0][0]         
__________________________________________________________________________________________________
stage2_unit3_conv2 (Conv2D)     (None, 7, 7, 128)    147456      zero_padding2d_8[0][0]           
__________________________________________________________________________________________________
stage2_unit3_bn3 (BatchNormaliz (None, 7, 7, 128)    512         stage2_unit3_conv2[0][0]         
__________________________________________________________________________________________________
stage2_unit3_relu3 (Activation) (None, 7, 7, 128)    0           stage2_unit3_bn3[0][0]           
__________________________________________________________________________________________________
stage2_unit3_conv3 (Conv2D)     (None, 7, 7, 512)    65536       stage2_unit3_relu3[0][0]         
__________________________________________________________________________________________________
add_6 (Add)                     (None, 7, 7, 512)    0           stage2_unit3_conv3[0][0]         
                                                                 add_5[0][0]                      
__________________________________________________________________________________________________
stage2_unit4_bn1 (BatchNormaliz (None, 7, 7, 512)    2048        add_6[0][0]                      
__________________________________________________________________________________________________
stage2_unit4_relu1 (Activation) (None, 7, 7, 512)    0           stage2_unit4_bn1[0][0]           
__________________________________________________________________________________________________
stage2_unit4_conv1 (Conv2D)     (None, 7, 7, 128)    65536       stage2_unit4_relu1[0][0]         
__________________________________________________________________________________________________
stage2_unit4_bn2 (BatchNormaliz (None, 7, 7, 128)    512         stage2_unit4_conv1[0][0]         
__________________________________________________________________________________________________
stage2_unit4_relu2 (Activation) (None, 7, 7, 128)    0           stage2_unit4_bn2[0][0]           
__________________________________________________________________________________________________
zero_padding2d_9 (ZeroPadding2D (None, 9, 9, 128)    0           stage2_unit4_relu2[0][0]         
__________________________________________________________________________________________________
stage2_unit4_conv2 (Conv2D)     (None, 7, 7, 128)    147456      zero_padding2d_9[0][0]           
__________________________________________________________________________________________________
stage2_unit4_bn3 (BatchNormaliz (None, 7, 7, 128)    512         stage2_unit4_conv2[0][0]         
__________________________________________________________________________________________________
stage2_unit4_relu3 (Activation) (None, 7, 7, 128)    0           stage2_unit4_bn3[0][0]           
__________________________________________________________________________________________________
stage2_unit4_conv3 (Conv2D)     (None, 7, 7, 512)    65536       stage2_unit4_relu3[0][0]         
__________________________________________________________________________________________________
add_7 (Add)                     (None, 7, 7, 512)    0           stage2_unit4_conv3[0][0]         
                                                                 add_6[0][0]                      
__________________________________________________________________________________________________
stage3_unit1_bn1 (BatchNormaliz (None, 7, 7, 512)    2048        add_7[0][0]                      
__________________________________________________________________________________________________
stage3_unit1_relu1 (Activation) (None, 7, 7, 512)    0           stage3_unit1_bn1[0][0]           
__________________________________________________________________________________________________
stage3_unit1_conv1 (Conv2D)     (None, 7, 7, 256)    131072      stage3_unit1_relu1[0][0]         
__________________________________________________________________________________________________
stage3_unit1_bn2 (BatchNormaliz (None, 7, 7, 256)    1024        stage3_unit1_conv1[0][0]         
__________________________________________________________________________________________________
stage3_unit1_relu2 (Activation) (None, 7, 7, 256)    0           stage3_unit1_bn2[0][0]           
__________________________________________________________________________________________________
zero_padding2d_10 (ZeroPadding2 (None, 9, 9, 256)    0           stage3_unit1_relu2[0][0]         
__________________________________________________________________________________________________
stage3_unit1_conv2 (Conv2D)     (None, 4, 4, 256)    589824      zero_padding2d_10[0][0]          
__________________________________________________________________________________________________
stage3_unit1_bn3 (BatchNormaliz (None, 4, 4, 256)    1024        stage3_unit1_conv2[0][0]         
__________________________________________________________________________________________________
stage3_unit1_relu3 (Activation) (None, 4, 4, 256)    0           stage3_unit1_bn3[0][0]           
__________________________________________________________________________________________________
stage3_unit1_conv3 (Conv2D)     (None, 4, 4, 1024)   262144      stage3_unit1_relu3[0][0]         
__________________________________________________________________________________________________
stage3_unit1_sc (Conv2D)        (None, 4, 4, 1024)   524288      stage3_unit1_relu1[0][0]         
__________________________________________________________________________________________________
add_8 (Add)                     (None, 4, 4, 1024)   0           stage3_unit1_conv3[0][0]         
                                                                 stage3_unit1_sc[0][0]            
__________________________________________________________________________________________________
stage3_unit2_bn1 (BatchNormaliz (None, 4, 4, 1024)   4096        add_8[0][0]                      
__________________________________________________________________________________________________
stage3_unit2_relu1 (Activation) (None, 4, 4, 1024)   0           stage3_unit2_bn1[0][0]           
__________________________________________________________________________________________________
stage3_unit2_conv1 (Conv2D)     (None, 4, 4, 256)    262144      stage3_unit2_relu1[0][0]         
__________________________________________________________________________________________________
stage3_unit2_bn2 (BatchNormaliz (None, 4, 4, 256)    1024        stage3_unit2_conv1[0][0]         
__________________________________________________________________________________________________
stage3_unit2_relu2 (Activation) (None, 4, 4, 256)    0           stage3_unit2_bn2[0][0]           
__________________________________________________________________________________________________
zero_padding2d_11 (ZeroPadding2 (None, 6, 6, 256)    0           stage3_unit2_relu2[0][0]         
__________________________________________________________________________________________________
stage3_unit2_conv2 (Conv2D)     (None, 4, 4, 256)    589824      zero_padding2d_11[0][0]          
__________________________________________________________________________________________________
stage3_unit2_bn3 (BatchNormaliz (None, 4, 4, 256)    1024        stage3_unit2_conv2[0][0]         
__________________________________________________________________________________________________
stage3_unit2_relu3 (Activation) (None, 4, 4, 256)    0           stage3_unit2_bn3[0][0]           
__________________________________________________________________________________________________
stage3_unit2_conv3 (Conv2D)     (None, 4, 4, 1024)   262144      stage3_unit2_relu3[0][0]         
__________________________________________________________________________________________________
add_9 (Add)                     (None, 4, 4, 1024)   0           stage3_unit2_conv3[0][0]         
                                                                 add_8[0][0]                      
__________________________________________________________________________________________________
stage3_unit3_bn1 (BatchNormaliz (None, 4, 4, 1024)   4096        add_9[0][0]                      
__________________________________________________________________________________________________
stage3_unit3_relu1 (Activation) (None, 4, 4, 1024)   0           stage3_unit3_bn1[0][0]           
__________________________________________________________________________________________________
stage3_unit3_conv1 (Conv2D)     (None, 4, 4, 256)    262144      stage3_unit3_relu1[0][0]         
__________________________________________________________________________________________________
stage3_unit3_bn2 (BatchNormaliz (None, 4, 4, 256)    1024        stage3_unit3_conv1[0][0]         
__________________________________________________________________________________________________
stage3_unit3_relu2 (Activation) (None, 4, 4, 256)    0           stage3_unit3_bn2[0][0]           
__________________________________________________________________________________________________
zero_padding2d_12 (ZeroPadding2 (None, 6, 6, 256)    0           stage3_unit3_relu2[0][0]         
__________________________________________________________________________________________________
stage3_unit3_conv2 (Conv2D)     (None, 4, 4, 256)    589824      zero_padding2d_12[0][0]          
__________________________________________________________________________________________________
stage3_unit3_bn3 (BatchNormaliz (None, 4, 4, 256)    1024        stage3_unit3_conv2[0][0]         
__________________________________________________________________________________________________
stage3_unit3_relu3 (Activation) (None, 4, 4, 256)    0           stage3_unit3_bn3[0][0]           
__________________________________________________________________________________________________
stage3_unit3_conv3 (Conv2D)     (None, 4, 4, 1024)   262144      stage3_unit3_relu3[0][0]         
__________________________________________________________________________________________________
add_10 (Add)                    (None, 4, 4, 1024)   0           stage3_unit3_conv3[0][0]         
                                                                 add_9[0][0]                      
__________________________________________________________________________________________________
stage3_unit4_bn1 (BatchNormaliz (None, 4, 4, 1024)   4096        add_10[0][0]                     
__________________________________________________________________________________________________
stage3_unit4_relu1 (Activation) (None, 4, 4, 1024)   0           stage3_unit4_bn1[0][0]           
__________________________________________________________________________________________________
stage3_unit4_conv1 (Conv2D)     (None, 4, 4, 256)    262144      stage3_unit4_relu1[0][0]         
__________________________________________________________________________________________________
stage3_unit4_bn2 (BatchNormaliz (None, 4, 4, 256)    1024        stage3_unit4_conv1[0][0]         
__________________________________________________________________________________________________
stage3_unit4_relu2 (Activation) (None, 4, 4, 256)    0           stage3_unit4_bn2[0][0]           
__________________________________________________________________________________________________
zero_padding2d_13 (ZeroPadding2 (None, 6, 6, 256)    0           stage3_unit4_relu2[0][0]         
__________________________________________________________________________________________________
stage3_unit4_conv2 (Conv2D)     (None, 4, 4, 256)    589824      zero_padding2d_13[0][0]          
__________________________________________________________________________________________________
stage3_unit4_bn3 (BatchNormaliz (None, 4, 4, 256)    1024        stage3_unit4_conv2[0][0]         
__________________________________________________________________________________________________
stage3_unit4_relu3 (Activation) (None, 4, 4, 256)    0           stage3_unit4_bn3[0][0]           
__________________________________________________________________________________________________
stage3_unit4_conv3 (Conv2D)     (None, 4, 4, 1024)   262144      stage3_unit4_relu3[0][0]         
__________________________________________________________________________________________________
add_11 (Add)                    (None, 4, 4, 1024)   0           stage3_unit4_conv3[0][0]         
                                                                 add_10[0][0]                     
__________________________________________________________________________________________________
stage3_unit5_bn1 (BatchNormaliz (None, 4, 4, 1024)   4096        add_11[0][0]                     
__________________________________________________________________________________________________
stage3_unit5_relu1 (Activation) (None, 4, 4, 1024)   0           stage3_unit5_bn1[0][0]           
__________________________________________________________________________________________________
stage3_unit5_conv1 (Conv2D)     (None, 4, 4, 256)    262144      stage3_unit5_relu1[0][0]         
__________________________________________________________________________________________________
stage3_unit5_bn2 (BatchNormaliz (None, 4, 4, 256)    1024        stage3_unit5_conv1[0][0]         
__________________________________________________________________________________________________
stage3_unit5_relu2 (Activation) (None, 4, 4, 256)    0           stage3_unit5_bn2[0][0]           
__________________________________________________________________________________________________
zero_padding2d_14 (ZeroPadding2 (None, 6, 6, 256)    0           stage3_unit5_relu2[0][0]         
__________________________________________________________________________________________________
stage3_unit5_conv2 (Conv2D)     (None, 4, 4, 256)    589824      zero_padding2d_14[0][0]          
__________________________________________________________________________________________________
stage3_unit5_bn3 (BatchNormaliz (None, 4, 4, 256)    1024        stage3_unit5_conv2[0][0]         
__________________________________________________________________________________________________
stage3_unit5_relu3 (Activation) (None, 4, 4, 256)    0           stage3_unit5_bn3[0][0]           
__________________________________________________________________________________________________
stage3_unit5_conv3 (Conv2D)     (None, 4, 4, 1024)   262144      stage3_unit5_relu3[0][0]         
__________________________________________________________________________________________________
add_12 (Add)                    (None, 4, 4, 1024)   0           stage3_unit5_conv3[0][0]         
                                                                 add_11[0][0]                     
__________________________________________________________________________________________________
stage3_unit6_bn1 (BatchNormaliz (None, 4, 4, 1024)   4096        add_12[0][0]                     
__________________________________________________________________________________________________
stage3_unit6_relu1 (Activation) (None, 4, 4, 1024)   0           stage3_unit6_bn1[0][0]           
__________________________________________________________________________________________________
stage3_unit6_conv1 (Conv2D)     (None, 4, 4, 256)    262144      stage3_unit6_relu1[0][0]         
__________________________________________________________________________________________________
stage3_unit6_bn2 (BatchNormaliz (None, 4, 4, 256)    1024        stage3_unit6_conv1[0][0]         
__________________________________________________________________________________________________
stage3_unit6_relu2 (Activation) (None, 4, 4, 256)    0           stage3_unit6_bn2[0][0]           
__________________________________________________________________________________________________
zero_padding2d_15 (ZeroPadding2 (None, 6, 6, 256)    0           stage3_unit6_relu2[0][0]         
__________________________________________________________________________________________________
stage3_unit6_conv2 (Conv2D)     (None, 4, 4, 256)    589824      zero_padding2d_15[0][0]          
__________________________________________________________________________________________________
stage3_unit6_bn3 (BatchNormaliz (None, 4, 4, 256)    1024        stage3_unit6_conv2[0][0]         
__________________________________________________________________________________________________
stage3_unit6_relu3 (Activation) (None, 4, 4, 256)    0           stage3_unit6_bn3[0][0]           
__________________________________________________________________________________________________
stage3_unit6_conv3 (Conv2D)     (None, 4, 4, 1024)   262144      stage3_unit6_relu3[0][0]         
__________________________________________________________________________________________________
add_13 (Add)                    (None, 4, 4, 1024)   0           stage3_unit6_conv3[0][0]         
                                                                 add_12[0][0]                     
__________________________________________________________________________________________________
stage4_unit1_bn1 (BatchNormaliz (None, 4, 4, 1024)   4096        add_13[0][0]                     
__________________________________________________________________________________________________
stage4_unit1_relu1 (Activation) (None, 4, 4, 1024)   0           stage4_unit1_bn1[0][0]           
__________________________________________________________________________________________________
stage4_unit1_conv1 (Conv2D)     (None, 4, 4, 512)    524288      stage4_unit1_relu1[0][0]         
__________________________________________________________________________________________________
stage4_unit1_bn2 (BatchNormaliz (None, 4, 4, 512)    2048        stage4_unit1_conv1[0][0]         
__________________________________________________________________________________________________
stage4_unit1_relu2 (Activation) (None, 4, 4, 512)    0           stage4_unit1_bn2[0][0]           
__________________________________________________________________________________________________
zero_padding2d_16 (ZeroPadding2 (None, 6, 6, 512)    0           stage4_unit1_relu2[0][0]         
__________________________________________________________________________________________________
stage4_unit1_conv2 (Conv2D)     (None, 2, 2, 512)    2359296     zero_padding2d_16[0][0]          
__________________________________________________________________________________________________
stage4_unit1_bn3 (BatchNormaliz (None, 2, 2, 512)    2048        stage4_unit1_conv2[0][0]         
__________________________________________________________________________________________________
stage4_unit1_relu3 (Activation) (None, 2, 2, 512)    0           stage4_unit1_bn3[0][0]           
__________________________________________________________________________________________________
stage4_unit1_conv3 (Conv2D)     (None, 2, 2, 2048)   1048576     stage4_unit1_relu3[0][0]         
__________________________________________________________________________________________________
stage4_unit1_sc (Conv2D)        (None, 2, 2, 2048)   2097152     stage4_unit1_relu1[0][0]         
__________________________________________________________________________________________________
add_14 (Add)                    (None, 2, 2, 2048)   0           stage4_unit1_conv3[0][0]         
                                                                 stage4_unit1_sc[0][0]            
__________________________________________________________________________________________________
stage4_unit2_bn1 (BatchNormaliz (None, 2, 2, 2048)   8192        add_14[0][0]                     
__________________________________________________________________________________________________
stage4_unit2_relu1 (Activation) (None, 2, 2, 2048)   0           stage4_unit2_bn1[0][0]           
__________________________________________________________________________________________________
stage4_unit2_conv1 (Conv2D)     (None, 2, 2, 512)    1048576     stage4_unit2_relu1[0][0]         
__________________________________________________________________________________________________
stage4_unit2_bn2 (BatchNormaliz (None, 2, 2, 512)    2048        stage4_unit2_conv1[0][0]         
__________________________________________________________________________________________________
stage4_unit2_relu2 (Activation) (None, 2, 2, 512)    0           stage4_unit2_bn2[0][0]           
__________________________________________________________________________________________________
zero_padding2d_17 (ZeroPadding2 (None, 4, 4, 512)    0           stage4_unit2_relu2[0][0]         
__________________________________________________________________________________________________
stage4_unit2_conv2 (Conv2D)     (None, 2, 2, 512)    2359296     zero_padding2d_17[0][0]          
__________________________________________________________________________________________________
stage4_unit2_bn3 (BatchNormaliz (None, 2, 2, 512)    2048        stage4_unit2_conv2[0][0]         
__________________________________________________________________________________________________
stage4_unit2_relu3 (Activation) (None, 2, 2, 512)    0           stage4_unit2_bn3[0][0]           
__________________________________________________________________________________________________
stage4_unit2_conv3 (Conv2D)     (None, 2, 2, 2048)   1048576     stage4_unit2_relu3[0][0]         
__________________________________________________________________________________________________
add_15 (Add)                    (None, 2, 2, 2048)   0           stage4_unit2_conv3[0][0]         
                                                                 add_14[0][0]                     
__________________________________________________________________________________________________
stage4_unit3_bn1 (BatchNormaliz (None, 2, 2, 2048)   8192        add_15[0][0]                     
__________________________________________________________________________________________________
stage4_unit3_relu1 (Activation) (None, 2, 2, 2048)   0           stage4_unit3_bn1[0][0]           
__________________________________________________________________________________________________
stage4_unit3_conv1 (Conv2D)     (None, 2, 2, 512)    1048576     stage4_unit3_relu1[0][0]         
__________________________________________________________________________________________________
stage4_unit3_bn2 (BatchNormaliz (None, 2, 2, 512)    2048        stage4_unit3_conv1[0][0]         
__________________________________________________________________________________________________
stage4_unit3_relu2 (Activation) (None, 2, 2, 512)    0           stage4_unit3_bn2[0][0]           
__________________________________________________________________________________________________
zero_padding2d_18 (ZeroPadding2 (None, 4, 4, 512)    0           stage4_unit3_relu2[0][0]         
__________________________________________________________________________________________________
stage4_unit3_conv2 (Conv2D)     (None, 2, 2, 512)    2359296     zero_padding2d_18[0][0]          
__________________________________________________________________________________________________
stage4_unit3_bn3 (BatchNormaliz (None, 2, 2, 512)    2048        stage4_unit3_conv2[0][0]         
__________________________________________________________________________________________________
stage4_unit3_relu3 (Activation) (None, 2, 2, 512)    0           stage4_unit3_bn3[0][0]           
__________________________________________________________________________________________________
stage4_unit3_conv3 (Conv2D)     (None, 2, 2, 2048)   1048576     stage4_unit3_relu3[0][0]         
__________________________________________________________________________________________________
add_16 (Add)                    (None, 2, 2, 2048)   0           stage4_unit3_conv3[0][0]         
                                                                 add_15[0][0]                     
__________________________________________________________________________________________________
bn1 (BatchNormalization)        (None, 2, 2, 2048)   8192        add_16[0][0]                     
__________________________________________________________________________________________________
relu1 (Activation)              (None, 2, 2, 2048)   0           bn1[0][0]                        
__________________________________________________________________________________________________
flatten_1 (Flatten)             (None, 8192)         0           relu1[0][0]                      
__________________________________________________________________________________________________
dense_1 (Dense)                 (None, 1024)         8389632     flatten_1[0][0]                  
__________________________________________________________________________________________________
dropout_1 (Dropout)             (None, 1024)         0           dense_1[0][0]                    
__________________________________________________________________________________________________
dense_2 (Dense)                 (None, 1)            1025        dropout_1[0][0]                  
==================================================================================================
Total params: 31,936,714
Trainable params: 31,891,140
Non-trainable params: 45,574
__________________________________________________________________________________________________
